IDEA Open Model
PolyLine2D.Segments Property
 Gets segments of PolyLine2D.
 Namespace: IdeaRS.OpenModel.Geometry2D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
public List<Segment2D> Segments { get; set; }
Public Property Segments As List(Of Segment2D)
	Get
	Set
public:
property List<Segment2D^>^ Segments {
	List<Segment2D^>^ get ();
	void set (List<Segment2D^>^ value);
}
Property Value
Type: List<Segment2D>
See Also
Reference
PolyLine2D Class
IdeaRS.OpenModel.Geometry2D Namespace